toasterllc/MDCCode/Code/STM32/Shared/USB.h
    static void USBD_GetStatus(const Toastbox::USB::SetupRequest& req)
    {
    switch (_Device.dev_state)
    {
    case USBD_STATE_DEFAULT:
    case USBD_STATE_ADDRESSED:
    case USBD_STATE_CONFIGURED:
    if (req.wLength != 0x2U)
    {
    _CmdAccept(false);
    break;
    }

    #if (USBD_SELF_POWERED == 1U)
    _Device.dev_config_status = USB_CONFIG_SELF_POWERED;
    #else
    _Device.dev_config_status = 0U;
    #endif

    if (_Device.dev_remote_wakeup != 0U)
    {
    _Device.dev_config_status |= USB_CONFIG_REMOTE_WAKEUP;
    }

    Send(0x80, (uint8_t*)&_Device.dev_config_status, 2);
    Assert(false);
    break;

    default:
    _CmdAccept(false);
    break;
    }
    }


    static void USBD_SetFeature(const Toastbox::USB::SetupRequest& req)
    {
    if (req.wValue == USB_FEATURE_REMOTE_WAKEUP)
    {
    _Device.dev_remote_wakeup = 1U;
    _CmdAccept(true);
    }
    }


    static void USBD_ClrFeature(const Toastbox::USB::SetupRequest& req)
    {
    switch (_Device.dev_state)
    {
    case USBD_STATE_DEFAULT:
    case USBD_STATE_ADDRESSED:
    case USBD_STATE_CONFIGURED:
    if (req.wValue == USB_FEATURE_REMOTE_WAKEUP)
    {
    _Device.dev_remote_wakeup = 0U;
    _CmdAccept(true);
    }
    break;

    default:
    _CmdAccept(false);
    break;
    }
    }

    static uint8_t USBD_GetLen(uint8_t *buf)
    {
    uint8_t  len = 0U;
    uint8_t *pbuff = buf;

    while (*pbuff != (uint8_t)'\0')
    {
    len++;
    pbuff++;
    }

    return len;
    }

    static void USBD_StdDevReq(const Toastbox::USB::SetupRequest& req) {
        switch (req.bmRequestType & Toastbox::USB::RequestType::TypeMask) {
//        case USB_REQ_TYPE_CLASS:
//        case USB_REQ_TYPE_VENDOR:
//            _CmdAccept(false);
//            break;
        case USB_REQ_TYPE_STANDARD: {
            switch (req.bRequest) {
            case USB_REQ_GET_DESCRIPTOR:    return USBD_GetDescriptor(req);
            case USB_REQ_SET_ADDRESS:       return USBD_SetAddress(req);
            case USB_REQ_SET_CONFIGURATION: return USBD_SetConfig(req);
            case USB_REQ_GET_CONFIGURATION: return USBD_GetConfig(req);
            case USB_REQ_GET_STATUS:        return USBD_GetStatus(req);
            case USB_REQ_SET_FEATURE:       return USBD_SetFeature(req);
            case USB_REQ_CLEAR_FEATURE:     return USBD_ClrFeature(req);
            default:                        break;
            }
        }}
        _CmdAccept(false);
    }
    
    static void USBD_StdItfReq(const Toastbox::USB::SetupRequest& req) {
        Assert(false);
//        switch (req.bmRequestType & Toastbox::USB::RequestType::TypeMask) {
//        case USB_REQ_TYPE_STANDARD:
//            switch (pdev->dev_state) {
//            case USBD_STATE_DEFAULT:
//            case USBD_STATE_ADDRESSED:
//            case USBD_STATE_CONFIGURED:
//                if (LOBYTE(req.wIndex) <= USBD_MAX_NUM_INTERFACES) {
//                    if (req.wLength == 0) {
//                        return _CmdAccept(true);
//                    }
//                }
//            }
//        }
//        _CmdAccept(false);
    }

    static void USBD_StdEPReq(const Toastbox::USB::SetupRequest& req) {
        Assert(false);
//        USBD_EndpointTypeDef *pep;
//        uint8_t ep_addr;
//        USBD_StatusTypeDef ret = USBD_OK;
//        ep_addr = LOBYTE(req.wIndex);
//        
//        switch (req.bmRequestType & Toastbox::USB::RequestType::TypeMask) {
//        case USB_REQ_TYPE_STANDARD:
//            switch (req.bRequest) {
//            case USB_REQ_SET_FEATURE:
//                switch (pdev->dev_state) {
//                case USBD_STATE_ADDRESSED:
//                    if ((ep_addr != 0x00U) && (ep_addr != 0x80U)) {
//                        (void)USBD_LL_StallEP(pdev, ep_addr);
//                        (void)USBD_LL_StallEP(pdev, 0x80U);
//                        return;
//                    }
//                
//                case USBD_STATE_CONFIGURED:
//                    if (req.wValue == USB_FEATURE_EP_HALT) {
//                        if ((ep_addr != 0x00U) && (ep_addr != 0x80U) && (req.wLength == 0x00U)) {
//                            USBD_LL_StallEP(pdev, ep_addr);
//                            return;
//                        }
//                    }
//                    return _CmdAccept(true);
//                }
//            
//            case USB_REQ_CLEAR_FEATURE:
//                switch (pdev->dev_state) {
//                case USBD_STATE_ADDRESSED:
//                    if ((ep_addr != 0x00U) && (ep_addr != 0x80U)) {
//                        (void)USBD_LL_StallEP(pdev, ep_addr);
//                        (void)USBD_LL_StallEP(pdev, 0x80U);
//                    
//                    } else {
//                        _CmdAccept(false);
//                    }
//                    break;
//                case USBD_STATE_CONFIGURED:
//                    if (req.wValue == USB_FEATURE_EP_HALT) {
//                        if ((ep_addr & 0x7FU) != 0x00U) {
//                            (void)USBD_LL_ClearStallEP(pdev, ep_addr);
//                        }
//                        _CmdAccept(true);
//                        Assert(false);
//                    //              (USBD_StatusTypeDef)pdev->pClass->Setup(pdev, req);
//                    }
//                    break;
//                default:
//                    _CmdAccept(false);
//                    break;
//                }
//                break;
//
//            case USB_REQ_GET_STATUS:
//                switch (pdev->dev_state) {
//                case USBD_STATE_ADDRESSED:
//                    if ((ep_addr != 0x00U) && (ep_addr != 0x80U)) {
//                        _CmdAccept(false);
//                        break;
//                    }
//                    
//                    pep = ((ep_addr & 0x80U) == 0x80U) ? &pdev->ep_in[ep_addr & 0x7FU] : \
//                    &pdev->ep_out[ep_addr & 0x7FU];
//                    pep->status = 0x0000U;
//
//                    Send(0x80, (uint8_t*)&pep->status, 2);
//                    Assert(false);
//                    break;
//                
//                case USBD_STATE_CONFIGURED:
//                    if ((ep_addr & 0x80U) == 0x80U) {
//                        if (pdev->ep_in[ep_addr & 0xFU].is_used == 0U) {
//                            _CmdAccept(false);
//                            break;
//                        }
//                    } else {
//                        if (pdev->ep_out[ep_addr & 0xFU].is_used == 0U) {
//                            _CmdAccept(false);
//                            break;
//                        }
//                    }
//                    
//                    pep = ((ep_addr & 0x80U) == 0x80U) ? &pdev->ep_in[ep_addr & 0x7FU] : \
//                    &pdev->ep_out[ep_addr & 0x7FU];
//                    
//                    if ((ep_addr == 0x00U) || (ep_addr == 0x80U)) {
//                        pep->status = 0x0000U;
//                    } else if (USBD_LL_IsStallEP(pdev, ep_addr) != 0U) {
//                        pep->status = 0x0001U;
//                    } else {
//                        pep->status = 0x0000U;
//                    }
//                    
//                    Send(0x80, (uint8_t*)&pep->status, 2);
//                    Assert(false);
//                    break;
//                
//                default:
//                    _CmdAccept(false);
//                    break;
//                }
//                break;
//
//            default:
//                _CmdAccept(false);
//                break;
//            }
//            break;
//        
//        default:
//            _CmdAccept(false);
//            break;
//        }
//
//        return ret;
//        
//        _CmdAccept(false);
    }

    static void _SetupRequestHandle(const Toastbox::USB::SetupRequest& req) {
        switch (req.bmRequestType & Toastbox::USB::RequestType::RecipientMask) {
        case USB_REQ_RECIPIENT_DEVICE:    return USBD_StdDevReq(req);
        case USB_REQ_RECIPIENT_INTERFACE: return USBD_StdItfReq(req);
        case USB_REQ_RECIPIENT_ENDPOINT:  return USBD_StdEPReq(req);
        }
        _CmdAccept(false);
    }
    
    static Toastbox::USB::SetupRequest SetupRequestRecv() {
        for (;;) {
            Toastbox::IntState ints(false);
            
            // Wait until we're in the Connecting state
            {
                T_Scheduler::Wait([] { return _State == State::Connecting || _State == State::Connected; });
                if (_State == State::Connecting) {
                    // Update our state
                    _State = State::Connected;
                    _SetupRequest = std::nullopt;
                }
            }
            
            // Wait for a command
            for (;;) {
                // Wait for a new command to arrive, or for our state to change
                T_Scheduler::Wait([] { return _SetupRequest || _State!=State::Connected; });
                
