toasterllc/MDCCode/Code/STM32/Shared/USB.h
    static uint8_t* _USBD_GetFSConfigDescriptor(uint16_t* len) {
        return nullptr;
    }
    
    static uint8_t* _USBD_GetOtherSpeedConfigDescriptor(uint16_t* len) {
        return nullptr;
    }
    
    static uint8_t* _USBD_GetDeviceQualifierDescriptor(uint16_t* len) {
        return nullptr;
    }
    
    static uint8_t* _USBD_GetUsrStrDescriptor(uint8_t index, uint16_t* len) {
        return nullptr;
    }
    
    // Ints must be disabled
    static void _CmdAccept(bool accept) {
        if (accept) {
//            USBD_CtlSendStatus(&_Device);
            // Send a zero-length packet (ZLP)
            Send(0x80, nullptr, 0);
        
        } else {
//            USBD_CtlError(&_Device);
            
            USBD_LL_StallEP(&_Device, 0x80);
            USBD_LL_StallEP(&_Device, 0x00);
        }
    }
    
    struct _WaitState {
        const uint8_t ep = 0;
        bool ok = false;
        size_t len = 0;
    };
    
    static bool _WaitRecv(_WaitState& ws) {
        // Short-circuit if we're not Connected
        if (_State != State::Connected) return true; // Done, failed
        
        const _EndpointState& eps = _EndpointStateGet(ws.ep);
        switch (eps.stage) {
        // Still waiting for completion
        case _EndpointStage::Busy:
            return false;
        // Done, success
        case _EndpointStage::Done:
            ws.ok = true;
            ws.len = eps.len;
            _AdvanceStateOut(ws.ep);
            return true;
        // Done, failed
        default:
            return true;
        }
    }
    
    static bool _WaitSend(_WaitState& ws) {
        // Short-circuit if we're not Connected
        if (_State != State::Connected) return true; // Done, failed
        
        const _EndpointState& eps = _EndpointStateGet(ws.ep);
        switch (eps.stage) {
        // Still waiting for completion
        case _EndpointStage::Busy:
            return false;
        // Done, success
        case _EndpointStage::Done:
            ws.ok = true;
            _AdvanceStateIn(ws.ep);
            return true;
        // Done, failed
        default:
            return true;
        }
    }
    
    // Ints must be disabled
    static void _EndpointReset(uint8_t ep) {
        if (_State != State::Connected) return; // Short-circuit if we're not Connected
        _EndpointState& eps = _EndpointStateGet(ep);
        eps.needsReset = true;
        if (_Ready(eps)) {
            if (EndpointOut(ep)) {
                _AdvanceStateOut(ep);
            } else {
                _AdvanceStateIn(ep);
            }
        }
    }
    
    // Ints must be disabled
    static bool _EndpointReady(uint8_t ep) {
        return _Ready(_EndpointStateGet(ep));
    }
    
    // Ints must be disabled
    static bool _EndpointsReady() {
        for (uint8_t ep : T_Config::Endpoints) {
            if (!_EndpointReady(ep)) return false;
        }
        return true;
    }
    
    // Ints must be disabled
    static bool _Ready(const _EndpointState& eps) {
        return eps.stage==_EndpointStage::Ready;
    }
    
    // Ints must be disabled
    static void _AdvanceStateOut(uint8_t ep) {
        _EndpointState& eps = _EndpointStateGet(ep);
        if (eps.needsReset) {
            eps.stage = _EndpointStage::Reset;
            eps.needsReset = false;
        }
        
        eps.len = USBD_LL_GetRxDataSize(&_Device, ep);
        
        // State transitions
        switch (eps.stage) {
        case _EndpointStage::Ready:     eps.stage = _EndpointStage::Busy; break;
        case _EndpointStage::Busy:      eps.stage = _EndpointStage::Done; break;
        case _EndpointStage::Done:      eps.stage = _EndpointStage::Ready; break;
        case _EndpointStage::Reset:     eps.stage = _EndpointStage::ResetZLP1; break;
        case _EndpointStage::ResetZLP1:
            // Only advance if we received a ZLP
            if (eps.len == 0) eps.stage = _EndpointStage::ResetSentinel;
            break;
        case _EndpointStage::ResetSentinel:
            // Only advance if we received the sentinel
            if (eps.len == sizeof(_ResetSentinel)) eps.stage = _EndpointStage::Ready;
            break;
        default:
            Assert(false);
        }
        
        // State actions
        switch (eps.stage) {
        case _EndpointStage::ResetZLP1:
        case _EndpointStage::ResetSentinel:
            USBD_LL_PrepareReceive(&_Device, ep, (uint8_t*)_DevNullAddr, MaxPacketSizeBulk);
            break;
        default:
            break;
        }
    }
    
    // Ints must be disabled
    static void _AdvanceStateIn(uint8_t ep) {
        _EndpointState& eps = _EndpointStateGet(ep);
        if (eps.needsReset) {
            eps.stage = _EndpointStage::Reset;
            eps.needsReset = false;
        }
        
        // We send two ZLPs (instead of just one) because if a transfer is in progress, the first ZLP will
        // get 'eaten' as a ZLP that terminates the existing transfer. So to guarantee that the reader
        // actually gets a ZLP, we have to send two.
        // After sending the two ZLPs, we also send a sentinel to account for the fact that we don't know
        // how many ZLPs that the reader will receive, because we don't know if the first ZLP will
        // necessarily terminate a transfer (because a transfer may not have been in progress, or if a
        // transfer was in progress, it may have sent exactly the number of bytes that the reader
        // requested, in which case no ZLP is needed to end the transfer). By using a sentinel, the
        // reader knows that no further ZLPs will be received after the sentinel has been received, and
        // therefore the endpoint is finished being reset.
        
        // State transitions
        switch (eps.stage) {
        case _EndpointStage::Ready:         eps.stage = _EndpointStage::Busy;          break;
        case _EndpointStage::Busy:          eps.stage = _EndpointStage::Done;          break;
        case _EndpointStage::Done:          eps.stage = _EndpointStage::Ready;         break;
        case _EndpointStage::Reset:         eps.stage = _EndpointStage::ResetZLP1;     break;
        case _EndpointStage::ResetZLP1:     eps.stage = _EndpointStage::ResetZLP2;     break;
        case _EndpointStage::ResetZLP2:     eps.stage = _EndpointStage::ResetSentinel; break;
        case _EndpointStage::ResetSentinel: eps.stage = _EndpointStage::Ready;         break;
        default:                            Assert(false);
        }
        
        // State actions
        switch (eps.stage) {
        case _EndpointStage::ResetZLP1:
        case _EndpointStage::ResetZLP2:
            USBD_LL_TransmitZeroLen(&_Device, ep);
            break;
        case _EndpointStage::ResetSentinel:
            USBD_LL_Transmit(&_Device, ep, (uint8_t*)&_ResetSentinel, sizeof(_ResetSentinel));
            break;
        default:
            break;
        }
    }
    
    static _EndpointState& _EndpointStateGet(uint8_t ep) {
        if (EndpointOut(ep)) {
            return _EndpointsOut[EndpointIdx(ep)];
        } else {
            return _EndpointsIn[EndpointIdx(ep)];
        }
    }
    
private:
    alignas(void*) // Aligned to send via USB
    static const inline uint8_t _ResetSentinel = 0;
    
    // _DevNullAddr: address that throw-away data can be written to.
    // This must be a region that a packet can be written to without causing
    // side-effects. We don't want to reserve actual RAM for this because it'd
    // just be wasted.
    // We're currently using the flash base address, so that the writes will be
    // ignored as long as the flash isn't unlocked.
    static constexpr uint32_t _DevNullAddr = 0x08000000;
    
//    alignas(void*) // Aligned to receive via USB
//    static inline uint8_t _CmdRecvBuf[MaxPacketSizeCtrl];
//    
//    static inline std::optional<size_t> _CmdRecvLen;
    
    static inline std::optional<Toastbox::USB::SetupRequest> _SetupRequest;
    
    static inline _EndpointState _EndpointsOut[1+EndpointCountOut()] = {};
    static inline _EndpointState _EndpointsIn[1+EndpointCountIn()] = {};
    static inline USBD_HandleTypeDef _Device;
    static inline PCD_HandleTypeDef _PCD;
    static inline State _State = State::Disconnected;
};
